# Importing Data Labraries

In [1]:
# Importing Labraries 
import pandas as pd
import numpy as np
import os

In [2]:
df_ords = pd.read_csv(r'C:\Users\alexg\InstacartBasketAnalysis\02Data\OriginalData\orders.csv', index_col =False)

03. Check for mixed-type data in your df_ords dataframe.

In [12]:
df_test = pd.DataFrame()

In [13]:
df_test['mix'] = ['a','b', 1, True]

In [14]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [15]:
#check mixed types
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

04. If you find mixed-type data, fix it. The column in question should contain observations of a single data type.

In [16]:
df_test['mix'] = df_test['mix'].astype('str')

05. Run a check for missing values in your df_ords dataframe.
In a markdown cell, report your findings and propose an explanation for any missing values you find.

In [3]:
df_ords.isnull().sum()

order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

The missing values could be due to data corruption or records were never entered.

06. Address the missing values using an appropriate method.
In a markdown cell, explain why you used your method of choice.

In [5]:
df_ords_nan = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [6]:
df_ords_nan

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
11,2168274,2,prior,1,2,11,NaN
26,1374495,3,prior,1,1,14,NaN
39,3343014,4,prior,1,6,11,NaN
45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,969311,206205,prior,1,4,12,NaN
3420934,3189322,206206,prior,1,3,18,NaN
3421002,2166133,206207,prior,1,6,19,NaN
3421019,2227043,206208,prior,1,1,15,NaN
3421069,3154581,206209,prior,1,3,11,NaN

In [8]:
df_ords.shape

(3421083, 7)

In [10]:
df_ords_clean = df_ords[df_ords['days_since_prior_order'].isnull() == False]

In [11]:
df_ords_clean.shape

(3214874, 7)

In [17]:
df_ords.describe()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [22]:
df_ords.fillna({'days_since_prior_order':df_ords['days_since_prior_order'].mean()})

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,11.114836
1,2398795,1,prior,2,3,7,15.000000
2,473747,1,prior,3,3,12,21.000000
3,2254736,1,prior,4,4,7,29.000000
4,431534,1,prior,5,4,15,28.000000
...,...,...,...,...,...,...,...
3421078,2266710,206209,prior,10,5,18,29.000000
3421079,1854736,206209,prior,11,4,10,30.000000
3421080,626363,206209,prior,12,1,12,18.000000
3421081,2977660,206209,prior,13,1,12,7.000000
3421082,272231,206209,train,14,6,14,30.000000

I choice to address the missing values by replacing the NaN with the min. I did this becuase I did not want to delete any data. Deleting data could hurt the data set. Using the min does not effect the data set. Later I would working on finding out where the missing data is or if it could be found.

07. Run a check for duplicate values in your df_ords data.
In a markdown cell, report your findings and propose an explanation for any duplicate values you find.

In [26]:
df_dups_ords = df_ords_clean[df_ords_clean.duplicated()]

In [27]:
df_dups_ords

Empty DataFrame
Columns: [order_id, user_id, eval_set, order_number, order_dow, order_hour_of_day, days_since_prior_order]
Index: []

08. Address the duplicates using an appropriate method.
In a markdown cell, explain why you used your method of choice.

No duplicates were found.

In [29]:
path = r'C:\Users\alexg\InstacartBasketAnalysis'

In [30]:
df_ords.to_csv(os.path.join(path, '02Data','PreparedData', 'orders_checked.csv'))